In [39]:
import sqlite3
import pandas as pd

In [77]:
con = sqlite3.connect('DbNEW.db')

In [78]:
df = pd.read_sql("""

    SELECT DISTINCT Employee
    FROM EmployeePoints

""", con)

In [79]:
df

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

In [80]:
df2 = pd.read_sql("""

   select Employee, count(*) from EmployeePoints
where Point = 5
group by Employee
order by count(*) desc

""", con)

In [81]:
df2

  Employee  count(*)
0     Маша         3
1     Саша         2